## Group Summary Statistics

In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\programdata\anaconda3\envs\myenv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlparse in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython-genutils in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (2.0.12)
Requirement already satisfied: six in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (8.13.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: backcall in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: stack-data in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: decorator in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=5 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: pygments>=2.4.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens>=2.1.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: pure-eval in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (1.2.0)

In [2]:
%load_ext sql
%sql sqlite:///Jobs.db

In [6]:
%%sql
SELECT Major,Major Category, MIN (Unemployment_rate)
    FROM recent_grads
        LIMIT 10;

 * sqlite:///Jobs.db
Done.

[('MATHEMATICS AND COMPUTER SCIENCE', 'MATHEMATICS AND COMPUTER SCIENCE', 0.0)]

In [7]:
%%sql
SELECT *
    FROM recent_grads
    LIMIT 5;

 * sqlite:///Jobs.db
Done.

[(0, 1, 2419, 'PETROLEUM ENGINEERING', 'Engineering', 2339, 36, 2057, 282, 0.120564344, 1976, 1849, 270, 1207, 37, 0.018380527, 110000, 95000, 125000, 1534, 364, 193),
 (1, 2, 2416, 'MINING AND MINERAL ENGINEERING', 'Engineering', 756, 7, 679, 77, 0.10185185199999999, 640, 556, 170, 388, 85, 0.117241379, 75000, 55000, 90000, 350, 257, 50),
 (2, 3, 2415, 'METALLURGICAL ENGINEERING', 'Engineering', 856, 3, 725, 131, 0.153037383, 648, 558, 133, 340, 16, 0.024096386, 73000, 50000, 105000, 456, 176, 0),
 (3, 4, 2417, 'NAVAL ARCHITECTURE AND MARINE ENGINEERING', 'Engineering', 1258, 16, 1123, 135, 0.107313196, 758, 1069, 150, 692, 40, 0.050125313, 70000, 43000, 80000, 529, 102, 0),
 (4, 5, 2405, 'CHEMICAL ENGINEERING', 'Engineering', 32260, 289, 21239, 11021, 0.341630502, 25694, 23170, 5180, 16697, 1672, 0.061097712, 65000, 50000, 75000, 18314, 4440, 972)]

## IF/THEN LOGIC

In [15]:
%%sql
SELECT Major_Category, Major,ShareWomen,
    CASE
        WHEN ShareWomen<0.2 THEN "Low"
        WHEN ShareWomen<=0.5 THEN "Medium"
        ELSE "High"
    END AS "Group
    FROM recent_grads
    LIMIT 5;

 * sqlite:///Jobs.db
Done.

[('Engineering', 'PETROLEUM ENGINEERING', 0.120564344, 'Low'),
 ('Engineering', 'MINING AND MINERAL ENGINEERING', 0.10185185199999999, 'Low'),
 ('Engineering', 'METALLURGICAL ENGINEERING', 0.153037383, 'Low'),
 ('Engineering', 'NAVAL ARCHITECTURE AND MARINE ENGINEERING', 0.107313196, 'Low'),
 ('Engineering', 'CHEMICAL ENGINEERING', 0.341630502, 'Medium')]

In [16]:
%%sql
SELECT Sample_size,
    CASE
        WHEN Sample_size<200 THEN "Small"
        WHEN Sample_size<1000 THEN "Medium"
        ELSE "Large"
    END AS Sample_category
FROM recent_grads
LIMIT 5;

 * sqlite:///Jobs.db
Done.

[(36, 'Small'), (7, 'Small'), (3, 'Small'), (16, 'Small'), (289, 'Medium')]


## GROUP BY

In [22]:
%%sql
SELECT  Major_Category,
    SUM(Unemployed) AS "Total Unemployed"
    FROM recent_grads
GROUP BY Major_category;

 * sqlite:///Jobs.db
Done.

[('Agriculture & Natural Resources', 3824),
 ('Arts', 28228),
 ('Biology & Life Science', 22854),
 ('Business', 79877),
 ('Communications & Journalism', 26852),
 ('Computers & Mathematics', 18373),
 ('Education', 24969),
 ('Engineering', 29817),
 ('Health', 22213),
 ('Humanities & Liberal Arts', 51101),
 ('Industrial Arts & Consumer Services', 11526),
 ('Interdisciplinary', 749),
 ('Law & Public Policy', 13495),
 ('Physical Sciences', 7880),
 ('Psychology & Social Work', 33292),
 ('Social Science', 42975)]

In [24]:
%%sql
SELECT Major_Category,Major,AVG(ShareWomen) AS AverageShareWomen
    FROM recent_grads
    GROUP BY Major_Category
    HAVING AverageShareWomen >0.7;

 * sqlite:///Jobs.db
Done.

[('Psychology & Social Work', 'INDUSTRIAL AND ORGANIZATIONAL PSYCHOLOGY', 0.7777631628888888)]

## CASTING

Changing from one data type to another

In [32]:
%%sql
SELECT 
    Major_category, 
    SUM(Unemployed) AS Total_unemployed,
    SUM(Total) AS Total_graduates,
   rOUND((CAST(SUM(Unemployed) AS FLOAT)/ SUM(Total)) * 100,2)  AS UnemploymentRate
FROM recent_grads
GROUP BY Major_category;

 * sqlite:///Jobs.db
Done.

[('Agriculture & Natural Resources', 3824, 79981, 4.78),
 ('Arts', 28228, 357130, 7.9),
 ('Biology & Life Science', 22854, 453862, 5.04),
 ('Business', 79877, 1302376, 6.13),
 ('Communications & Journalism', 26852, 392601, 6.84),
 ('Computers & Mathematics', 18373, 299008, 6.14),
 ('Education', 24969, 559129, 4.47),
 ('Engineering', 29817, 537583, 5.55),
 ('Health', 22213, 463230, 4.8),
 ('Humanities & Liberal Arts', 51101, 713468, 7.16),
 ('Industrial Arts & Consumer Services', 11526, 229792, 5.02),
 ('Interdisciplinary', 749, 12296, 6.09),
 ('Law & Public Policy', 13495, 179107, 7.53),
 ('Physical Sciences', 7880, 185479, 4.25),
 ('Psychology & Social Work', 33292, 481007, 6.92),
 ('Social Science', 42975, 529966, 8.11)]